2018.11.27.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[http://alan.petitepomme.net/cwn/2018.11.20.html][Previous Week]] [[http://alan.petitepomme.net/cwn/index.html][Up]] [[http://alan.petitepomme.net/cwn/2018.12.04.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of November 20 to 27, 2018.

#+TOC: headlines 1


* Published a post about what we are doing and going to do about BuckleScript development
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/published-a-post-about-what-we-are-doing-and-going-to-do-about-bucklescript-development/2920/1

** Hongbo Zhang announced


In case you are interested, here is the link: https://bucklescript.github.io/blog/2018/11/19/next-half
      



* Ocamlformat and the ocaml.org coding guidelines
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ocamlformat-and-the-ocaml-org-coding-guidelines/2922/1

** Anil Madhavapeddy announced


I just wanted to draw the community's attention to [ocamlformat#501], which gathers together many of the coding guidelines for OCaml, with the goal of ensuring that ocamlformat can automate the formatting process.

As noted on the issue, the current coding guidelines are designed for humans, but we are increasingly getting tools such as ocamlformat and ocp-indent which mechanise the process.  This is a good chance to get involved at this point in ocamlformat's development with this, especially if you have a large codebase which could benefit from standardised formatting in the near future.  Please weigh in at [[https://github.com/ocaml-ppx/ocamlformat/issues/501][ocamlformat#501]], especially with pointers to counterexamples to your own codebases if applicable.
      



* Release of OCaml-R
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00028.html

** Philippe Veber announced


  I'd like to announce a preview release of ocaml-r, a library that can be
used to interact with the R language interpreter and write clean wrappers
to R functions and packages. This library was developped a long time ago by
Maxence Guesdon and Guillaume Yziquel, and I've maintained it since then
for my own needs. The library is available on opam, under version 0.1.1,
and on github [0].

  The goal of this release is to see if other people could find it useful,
in which case I can spend a little more time writing documentation on how
to use it, and help write more wrappers. Please get in touch via the issue
tracker if interested.

  Cheers,\\
     Philippe.

[0] https://github.com/pveber/ocaml-r
      



* Resources for Advanced Module Usage
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/resources-for-advanced-module-usage/1774/1

** robkuz asked


does anybody have links/tutorials etc. for usage of modules?
I have read the lightweight higher kinded types paper and I am searching for other resources in that direction.
      

