2018.11.27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-27 Tue 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2018.11.20.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2018.12.04.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of November 20 to 27, 2018.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Published a post about what we are doing and going to do about BuckleScript development</a></li>
<li><a href="#2">Ocamlformat and the ocaml.org coding guidelines</a></li>
<li><a href="#3">Release of OCaml-R</a></li>
<li><a href="#4">Resources for Advanced Module Usage</a></li>
<li><a href="#5">Digestif 0.7.1</a></li>
<li><a href="#6">Xavier Leroy (and others) - On Computer Science</a></li>
<li><a href="#7">md2mld 0.3.0</a></li>
<li><a href="#8">Wanted: new maintainer for cppo</a></li>
<li><a href="#9">Build-/Installation-Tools - not enogh of them?</a></li>
<li><a href="#10">Ocaml Github Pull Requests</a></li>
<li><a href="#11">Other OCaml News</a></li>
<li><a href="#org90cb535">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-org0a3a71e" class="outline-2">
<h2 id="1"><a id="org0a3a71e"></a>Published a post about what we are doing and going to do about BuckleScript development</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/published-a-post-about-what-we-are-doing-and-going-to-do-about-bucklescript-development/2920/1">https://discuss.ocaml.org/t/published-a-post-about-what-we-are-doing-and-going-to-do-about-bucklescript-development/2920/1</a>
</p>
</div>

<div id="outline-container-orge77a41c" class="outline-3">
<h3 id="orge77a41c">Hongbo Zhang announced</h3>
<div class="outline-text-3" id="text-orge77a41c">
<p>
In case you are interested, here is the link: <a href="https://bucklescript.github.io/blog/2018/11/19/next-half">https://bucklescript.github.io/blog/2018/11/19/next-half</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org4138067" class="outline-2">
<h2 id="2"><a id="org4138067"></a>Ocamlformat and the ocaml.org coding guidelines</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocamlformat-and-the-ocaml-org-coding-guidelines/2922/1">https://discuss.ocaml.org/t/ocamlformat-and-the-ocaml-org-coding-guidelines/2922/1</a>
</p>
</div>

<div id="outline-container-orgdf19f5c" class="outline-3">
<h3 id="orgdf19f5c">Anil Madhavapeddy announced</h3>
<div class="outline-text-3" id="text-orgdf19f5c">
<p>
I just wanted to draw the community's attention to [ocamlformat#501], which gathers together many of the coding guidelines for OCaml, with the goal of ensuring that ocamlformat can automate the formatting process.
</p>

<p>
As noted on the issue, the current coding guidelines are designed for humans, but we are increasingly getting tools such as ocamlformat and ocp-indent which mechanise the process.  This is a good chance to get involved at this point in ocamlformat's development with this, especially if you have a large codebase which could benefit from standardised formatting in the near future.  Please weigh in at <a href="https://github.com/ocaml-ppx/ocamlformat/issues/501">ocamlformat#501</a>, especially with pointers to counterexamples to your own codebases if applicable.
</p>
</div>
</div>
</div>




<div id="outline-container-org37197c9" class="outline-2">
<h2 id="3"><a id="org37197c9"></a>Release of OCaml-R</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00028.html">https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00028.html</a>
</p>
</div>

<div id="outline-container-org705d585" class="outline-3">
<h3 id="org705d585">Philippe Veber announced</h3>
<div class="outline-text-3" id="text-org705d585">
<p>
  I'd like to announce a preview release of ocaml-r, a library that can be
used to interact with the R language interpreter and write clean wrappers
to R functions and packages. This library was developped a long time ago by
Maxence Guesdon and Guillaume Yziquel, and I've maintained it since then
for my own needs. The library is available on opam, under version 0.1.1,
and on github [0].
</p>

<p>
  The goal of this release is to see if other people could find it useful,
in which case I can spend a little more time writing documentation on how
to use it, and help write more wrappers. Please get in touch via the issue
tracker if interested.
</p>

<p>
Cheers,<br />
   Philippe.
</p>

<p>
[0] <a href="https://github.com/pveber/ocaml-r">https://github.com/pveber/ocaml-r</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org37630ef" class="outline-2">
<h2 id="4"><a id="org37630ef"></a>Resources for Advanced Module Usage</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/resources-for-advanced-module-usage/1774/1">https://discuss.ocaml.org/t/resources-for-advanced-module-usage/1774/1</a>
</p>
</div>

<div id="outline-container-org2c5eaf4" class="outline-3">
<h3 id="org2c5eaf4">robkuz asked</h3>
<div class="outline-text-3" id="text-org2c5eaf4">
<p>
does anybody have links/tutorials etc. for usage of modules?
I have read the lightweight higher kinded types paper and I am searching for other resources in that direction.
</p>
</div>
</div>
