2018.11.27.org
** kantian replied


You can have a look on the paper [[https://www.cs.tufts.edu/~nr/pubs/maniaws-abstract.html][ML module mania]] which present a type safe, separetly compiled and extensible interpreter for the Lua language. In the same spirit, you have the work of Oleg Kiselyov on [[http://okmij.org/ftp/tagless-final/course/optimizations.html][tagless-final embedded DSL]]. Or from the same author than the paper on ligthweight higher-kinded types, you have their proposal for [[https://www.cl.cam.ac.uk/~jdy22/papers/modular-implicits.pdf][modular implicit]] which go further.

About the last paper, imagine that you want to write a function ~show~ that works on mutliple data types but not uniformly. In a lot of languages, this is done with dynamic dispatching. Since OCaml doesn't have runtime type representation, we have  to rely on something which is closed to a static dispatching, and we can do this with *first-class* modules.

#+begin_src ocaml
module type Showable = sig
  type t
  val show : t -> string
end

let show (type a) (module M : Showable with type t = a) x = M.show x
#+end_src

Now you can define a module for each type that you want to convert to a `string`, and you have to *explicitly* pass it to your fonction `show`.

#+begin_src ocaml
module Int_show = struct
  type t = int
  let show = string_of_int
end

module Float_show = struct
  type t = float
  let show = string_of_float
end

# show (module Int_show) 3;;
- : string = "3"

# show (module Float_show) 3.4;;
- : string = "3.4"
#+end_src

The idea behind modular implicit is that in this situation, the module to use to show your value is *automatically infered* by the compiler in such a way that you don't have to *explicitly* pass it to your function. This will be very useful, especially when the module in question is the result of a functor application. Indeed, imagine that you know how to show values of two types ~a~ and ~b~, then you know how to show a pair of type ~a * b~. To encode this you have to write a *functor*:

#+begin_src ocaml
module Pair_show (A : Showable) (B : Showable):
Showable with type t = A.t * B.t = struct
  type t = A.t * B.t
  let show (x,y) = Printf.sprintf "(%s, %s)" (A.show x) (B.show y)
end

# show (module Pair_show (Int_show) (Float_show)) (1, 2.5);;
- : string = "(1, 2.5)"
#+end_src
      

** Michael Thomas asked and Daniel Bünzli replied


> This looks really interesting - do you know if the complete source code is available anywhere?

It's [[https://github.com/lindig/lua-ml][here]].
      

** Ivan Gotovchits also replied


The [Modules][1] section is a prerequisite must read. All advance papers more or less are based on these papers. The [F-ing modules][2] paper is a very interesting read, albeit being a little bit fictional. I also found [this thesis][3] to be an interesting compilation, although it is focusing more on SML.


[1]: https://ocaml.org/docs/papers.html#Modules \\
[2]: https://people.mpi-sws.org/~rossberg/f-ing/f-ing-jfp.pdf \\
[3]: https://people.mpi-sws.org/~dreyer/thesis/old/thesis050405.pdf
      



* Digestif 0.7.1
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-digestif-0-7-1/2941/1

