2018.11.27.html


<div id="outline-container-org5ec8ce0" class="outline-3">
<h3 id="org5ec8ce0">kantian replied</h3>
<div class="outline-text-3" id="text-org5ec8ce0">
<p>
You can have a look on the paper <a href="https://www.cs.tufts.edu/~nr/pubs/maniaws-abstract.html">ML module mania</a> which present a type safe, separetly compiled and extensible interpreter for the Lua language. In the same spirit, you have the work of Oleg Kiselyov on <a href="http://okmij.org/ftp/tagless-final/course/optimizations.html">tagless-final embedded DSL</a>. Or from the same author than the paper on ligthweight higher-kinded types, you have their proposal for <a href="https://www.cl.cam.ac.uk/~jdy22/papers/modular-implicits.pdf">modular implicit</a> which go further.
</p>

<p>
About the last paper, imagine that you want to write a function <code>show</code> that works on mutliple data types but not uniformly. In a lot of languages, this is done with dynamic dispatching. Since OCaml doesn't have runtime type representation, we have  to rely on something which is closed to a static dispatching, and we can do this with <b>first-class</b> modules.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">Showable</span> <span style="color: #a52a2a;">=</span> <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span>
  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">show</span> <span style="color: #a52a2a;">:</span> t <span style="color: #a52a2a;">-&gt;</span> string
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">show</span><span style="color: #a0522d;"> </span><span style="color: #a52a2a;">(</span><span style="color: #a020f0;">type</span><span style="color: #a0522d;"> </span><span style="color: #228b22;">a</span><span style="color: #a52a2a;">)</span><span style="color: #a0522d;"> </span><span style="color: #a52a2a;">(</span><span style="color: #a020f0;">module</span><span style="color: #a0522d;"> </span><span style="color: #228b22;">M</span><span style="color: #a0522d;"> </span><span style="color: #a52a2a;">:</span><span style="color: #228b22;"> </span><span style="color: #228b22;">Showable with type t = a</span><span style="color: #a52a2a;">)</span><span style="color: #a0522d;"> x</span> <span style="color: #a52a2a;">=</span> <span style="color: #228b22;">M.</span>show x
</pre>
</div>

<p>
Now you can define a module for each type that you want to convert to a `string`, and you have to <b>explicitly</b> pass it to your fonction `show`.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Int_show</span> <span style="color: #a52a2a;">=</span> <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span> <span style="color: #a52a2a;">=</span> int
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">show</span> <span style="color: #a52a2a;">=</span> string_of_int
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Float_show</span> <span style="color: #a52a2a;">=</span> <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span> <span style="color: #a52a2a;">=</span> float
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">show</span> <span style="color: #a52a2a;">=</span> string_of_float
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #a52a2a;">#</span> show <span style="color: #a52a2a;">(</span><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Int_show</span><span style="color: #a52a2a;">)</span> 3<span style="color: #ff4500;">;;</span>
<span style="color: #a52a2a;">-</span> <span style="color: #a52a2a;">:</span> string <span style="color: #a52a2a;">=</span> <span style="color: #8b2252;">"3"</span>

<span style="color: #a52a2a;">#</span> show <span style="color: #a52a2a;">(</span><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Float_show</span><span style="color: #a52a2a;">)</span> 3.4<span style="color: #ff4500;">;;</span>
<span style="color: #a52a2a;">-</span> <span style="color: #a52a2a;">:</span> string <span style="color: #a52a2a;">=</span> <span style="color: #8b2252;">"3.4"</span>
</pre>
</div>

<p>
The idea behind modular implicit is that in this situation, the module to use to show your value is <b>automatically infered</b> by the compiler in such a way that you don't have to <b>explicitly</b> pass it to your function. This will be very useful, especially when the module in question is the result of a functor application. Indeed, imagine that you know how to show values of two types <code>a</code> and <code>b</code>, then you know how to show a pair of type <code>a * b</code>. To encode this you have to write a <b>functor</b>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Pair_show</span> <span style="color: #a52a2a;">(</span><span style="color: #a0522d;">A </span><span style="color: #a52a2a;">:</span><span style="color: #228b22;"> Showable</span><span style="color: #a52a2a;">)</span><span style="color: #a0522d;"> </span><span style="color: #a52a2a;">(</span><span style="color: #a0522d;">B </span><span style="color: #a52a2a;">:</span><span style="color: #228b22;"> Showable</span><span style="color: #a52a2a;">):</span>
<span style="color: #228b22;">Showable</span> <span style="color: #000000; font-weight: bold;">with type</span> <span style="color: #228b22;">t</span> <span style="color: #a52a2a;">=</span> <span style="color: #228b22;">A.</span>t <span style="color: #a52a2a;">*</span> <span style="color: #228b22;">B.</span>t <span style="color: #a52a2a;">=</span> <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span> <span style="color: #a52a2a;">=</span> <span style="color: #228b22;">A.</span>t <span style="color: #a52a2a;">*</span> <span style="color: #228b22;">B.</span>t
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">show</span><span style="color: #a0522d;"> </span><span style="color: #a52a2a;">(</span><span style="color: #a0522d;">x</span><span style="color: #a52a2a;">,</span><span style="color: #a0522d;">y</span><span style="color: #a52a2a;">)</span> <span style="color: #a52a2a;">=</span> <span style="color: #228b22;">Printf.</span>sprintf <span style="color: #8b2252;">"(%s, %s)"</span> <span style="color: #a52a2a;">(</span><span style="color: #228b22;">A.</span>show x<span style="color: #a52a2a;">)</span> <span style="color: #a52a2a;">(</span><span style="color: #228b22;">B.</span>show y<span style="color: #a52a2a;">)</span>
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #a52a2a;">#</span> show <span style="color: #a52a2a;">(</span><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Pair_show</span> <span style="color: #a52a2a;">(</span><span style="color: #000000; background-color: #ffffff;">Int_show</span><span style="color: #a52a2a;">)</span> <span style="color: #a52a2a;">(</span><span style="color: #000000; background-color: #ffffff;">Float_show</span><span style="color: #a52a2a;">))</span> <span style="color: #a52a2a;">(</span>1<span style="color: #a52a2a;">,</span> 2.5<span style="color: #a52a2a;">)</span><span style="color: #ff4500;">;;</span>
<span style="color: #a52a2a;">-</span> <span style="color: #a52a2a;">:</span> string <span style="color: #a52a2a;">=</span> <span style="color: #8b2252;">"(1, 2.5)"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org382ca35" class="outline-3">
<h3 id="org382ca35">Michael Thomas asked and Daniel Bünzli replied</h3>
<div class="outline-text-3" id="text-org382ca35">
<p>
&gt; This looks really interesting - do you know if the complete source code is available anywhere?
</p>

<p>
It's <a href="https://github.com/lindig/lua-ml">here</a>.
</p>
</div>
</div>


<div id="outline-container-orgc01d929" class="outline-3">
<h3 id="orgc01d929">Ivan Gotovchits also replied</h3>
<div class="outline-text-3" id="text-orgc01d929">
<p>
The [Modules][1] section is a prerequisite must read. All advance papers more or less are based on these papers. The [F-ing modules][2] paper is a very interesting read, albeit being a little bit fictional. I also found [this thesis][3] to be an interesting compilation, although it is focusing more on SML.
</p>


<p>
[1]: <a href="https://ocaml.org/docs/papers.html#Modules">https://ocaml.org/docs/papers.html#Modules</a> <br />
[2]: <a href="https://people.mpi-sws.org/~rossberg/f-ing/f-ing-jfp.pdf">https://people.mpi-sws.org/~rossberg/f-ing/f-ing-jfp.pdf</a> <br />
[3]: <a href="https://people.mpi-sws.org/~dreyer/thesis/old/thesis050405.pdf">https://people.mpi-sws.org/~dreyer/thesis/old/thesis050405.pdf</a>
</p>
</div>
</div>
</div>




<div id="outline-container-orge927af0" class="outline-2">
<h2 id="5"><a id="orge927af0"></a>Digestif 0.7.1</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-digestif-0-7-1/2941/1">https://discuss.ocaml.org/t/ann-digestif-0-7-1/2941/1</a>
</p>
</div>
