2018.11.27.org
** Charles Edouard Lecat announced


I’m happy to announce a new release of [[https://github.com/mirage/digestif/releases/tag/v0.7.1][digestif 0.7.1]], available for installation via OPAM.

Digestif is a library which contains some hashes function like:
- MD5
- SHA1
- SHA224
- SHA256
- SHA384
- SHA512
- BLAKE2B
- BLAKE2S
- RIPEMD160

And the recently added
- WHIRLPOOL

Particularities of digestif:

Linking trick:
This project provides 2 implementations of the hash algorithms: one written in C (digestif.c) and the other in OCaml (digestif.ocaml), each one fulfilling the same interface. In order to choose your implementation, you can simply use the linking trick, by selecting at link time the implementation you wish to use. The C implementation will provide a smaller execution time, while the OCaml one will bring more portability to your project (ex: to JavaScript with js_of_ocaml).

Constant time:
Some applications require that secret values are compared in constant time. This Functions like String.equal do not have this property, so we provide a small package — eqaf — providing a constant-time equal function. Digestif uses it to check equality of hashes — it also exposes unsafe_compare if you don’t care about timing attacks in your application.

Run-time lock:
When calling C code from the OCaml environment, the garbage collector states needs to be saved as C code may need allocated values, which the GC could move or change. This is why we implemented the hash algorithms with bigarrays, which are contained in a specific area of the GC, and never will be moved. This way, we were able to remove the run-time lock when calling the others C functions, improving the speed of the computations. A behavior even more useful as the GC is global in a multi-threaded environment, locking it pauses every threads: With digestif you can compute the hash in parallel of others operations without affecting your performances.
      



* Xavier Leroy (and others) - On Computer Science
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/xavier-leroy-and-others-on-computer-science/2942/1

** Jp R announced


For those of you who understand French, I invite you to follow a serie of courses on computer science at the College de France.

Xavier Leroy a mis son beau costume, sa chemise blanche et sa cravate pour nous parler des sciences du logiciel.

A must see!

https://www.college-de-france.fr/site/xavier-leroy/inaugural-lecture-2018-11-15-18h00.htm
      



* md2mld 0.3.0
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-md2mld-0-3-0/2948/1

** Marcello Seri announced


I am happy to announce the first release of [[https://github.com/mseri/md2mld][md2mld]], available now from OPAM.

~md2mld~  converts a Markdown-format file into the  ~mld~  format used by [[https://github.com/ocaml/odoc][odoc]] to render HTML documentation or OCaml libraries. You can use this script to automatically embed a  ~README.md~  file into API documentation for an OCaml library.

I made it because multiple repositories have their most interesting short examples in their README, and I wanted an easy way to integrate them in the generated documentation without duplicating too much the efforts.

You can see an example of use in the documentation of [[https://github.com/mseri/md2mld][the tool itself]] and in the new documentation of [[http://mirage.github.io/ocaml-rpc/rpclib/rpc/index.html][ocaml-rpc]].
      



* Wanted: new maintainer for cppo
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/wanted-new-maintainer-for-cppo/2959/1

** Martin Jambon announced


[[https://github.com/ocaml-community/cppo][Cppo]] is a C-style preprocessor for OCaml. I started the project in 2009, when I was working on yojson and didn't want to be tied to camlp4 for simple things like ~#include~ and conditional compilation. Since then, other projects have used it, typically as a last resort to manage version incompatibilities. Today, 57 packages in opam depend directly on cppo.

The project was recently handed off to [[https://github.com/ocaml-community/meta][ocaml-community]] in an effort to benefit from a wider community. I no longer wish to be in charge of supervising the project because it's too much for me, when combined with other projects. Ideally, we're looking for a person maintaining cppo with the support of their employer. The project is very stable. There are no new features in sight and very few bug reports. Maintenance would consist in roughly one day a month, generally spent answering incoming questions and working with users to solve their problems or review patches.

Let us know if you're interested!
      



* Build-/Installation-Tools - not enogh of them?
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00059.html

