2018.11.27.html

<div id="outline-container-org46a5931" class="outline-3">
<h3 id="org46a5931">Charles Edouard Lecat announced</h3>
<div class="outline-text-3" id="text-org46a5931">
<p>
I’m happy to announce a new release of <a href="https://github.com/mirage/digestif/releases/tag/v0.7.1">digestif 0.7.1</a>, available for installation via OPAM.
</p>

<p>
Digestif is a library which contains some hashes function like:
</p>
<ul class="org-ul">
<li>MD5</li>
<li>SHA1</li>
<li>SHA224</li>
<li>SHA256</li>
<li>SHA384</li>
<li>SHA512</li>
<li>BLAKE2B</li>
<li>BLAKE2S</li>
<li>RIPEMD160</li>
</ul>

<p>
And the recently added
</p>
<ul class="org-ul">
<li>WHIRLPOOL</li>
</ul>

<p>
Particularities of digestif:
</p>

<p>
Linking trick:
This project provides 2 implementations of the hash algorithms: one written in C (digestif.c) and the other in OCaml (digestif.ocaml), each one fulfilling the same interface. In order to choose your implementation, you can simply use the linking trick, by selecting at link time the implementation you wish to use. The C implementation will provide a smaller execution time, while the OCaml one will bring more portability to your project (ex: to JavaScript with js_of_ocaml).
</p>

<p>
Constant time:
Some applications require that secret values are compared in constant time. This Functions like String.equal do not have this property, so we provide a small package — eqaf — providing a constant-time equal function. Digestif uses it to check equality of hashes — it also exposes unsafe_compare if you don’t care about timing attacks in your application.
</p>

<p>
Run-time lock:
When calling C code from the OCaml environment, the garbage collector states needs to be saved as C code may need allocated values, which the GC could move or change. This is why we implemented the hash algorithms with bigarrays, which are contained in a specific area of the GC, and never will be moved. This way, we were able to remove the run-time lock when calling the others C functions, improving the speed of the computations. A behavior even more useful as the GC is global in a multi-threaded environment, locking it pauses every threads: With digestif you can compute the hash in parallel of others operations without affecting your performances.
</p>
</div>
</div>
</div>




<div id="outline-container-org8b571fe" class="outline-2">
<h2 id="6"><a id="org8b571fe"></a>Xavier Leroy (and others) - On Computer Science</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/xavier-leroy-and-others-on-computer-science/2942/1">https://discuss.ocaml.org/t/xavier-leroy-and-others-on-computer-science/2942/1</a>
</p>
</div>

<div id="outline-container-org52679b6" class="outline-3">
<h3 id="org52679b6">Jp R announced</h3>
<div class="outline-text-3" id="text-org52679b6">
<p>
For those of you who understand French, I invite you to follow a serie of courses on computer science at the College de France.
</p>

<p>
Xavier Leroy a mis son beau costume, sa chemise blanche et sa cravate pour nous parler des sciences du logiciel.
</p>

<p>
A must see!
</p>

<p>
<a href="https://www.college-de-france.fr/site/xavier-leroy/inaugural-lecture-2018-11-15-18h00.htm">https://www.college-de-france.fr/site/xavier-leroy/inaugural-lecture-2018-11-15-18h00.htm</a>
</p>
</div>
</div>
</div>




<div id="outline-container-orgc53eaf9" class="outline-2">
<h2 id="7"><a id="orgc53eaf9"></a>md2mld 0.3.0</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-md2mld-0-3-0/2948/1">https://discuss.ocaml.org/t/ann-md2mld-0-3-0/2948/1</a>
</p>
</div>

<div id="outline-container-orgdd27f37" class="outline-3">
<h3 id="orgdd27f37">Marcello Seri announced</h3>
<div class="outline-text-3" id="text-orgdd27f37">
<p>
I am happy to announce the first release of <a href="https://github.com/mseri/md2mld">md2mld</a>, available now from OPAM.
</p>

<p>
<code>md2mld</code>  converts a Markdown-format file into the  <code>mld</code>  format used by <a href="https://github.com/ocaml/odoc">odoc</a> to render HTML documentation or OCaml libraries. You can use this script to automatically embed a  <code>README.md</code>  file into API documentation for an OCaml library.
</p>

<p>
I made it because multiple repositories have their most interesting short examples in their README, and I wanted an easy way to integrate them in the generated documentation without duplicating too much the efforts.
</p>

<p>
You can see an example of use in the documentation of <a href="https://github.com/mseri/md2mld">the tool itself</a> and in the new documentation of <a href="http://mirage.github.io/ocaml-rpc/rpclib/rpc/index.html">ocaml-rpc</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-org2bd6ac5" class="outline-2">
<h2 id="8"><a id="org2bd6ac5"></a>Wanted: new maintainer for cppo</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/wanted-new-maintainer-for-cppo/2959/1">https://discuss.ocaml.org/t/wanted-new-maintainer-for-cppo/2959/1</a>
</p>
</div>

<div id="outline-container-org666a5e3" class="outline-3">
<h3 id="org666a5e3">Martin Jambon announced</h3>
<div class="outline-text-3" id="text-org666a5e3">
<p>
<a href="https://github.com/ocaml-community/cppo">Cppo</a> is a C-style preprocessor for OCaml. I started the project in 2009, when I was working on yojson and didn't want to be tied to camlp4 for simple things like <code>#include</code> and conditional compilation. Since then, other projects have used it, typically as a last resort to manage version incompatibilities. Today, 57 packages in opam depend directly on cppo.
</p>

<p>
The project was recently handed off to <a href="https://github.com/ocaml-community/meta">ocaml-community</a> in an effort to benefit from a wider community. I no longer wish to be in charge of supervising the project because it's too much for me, when combined with other projects. Ideally, we're looking for a person maintaining cppo with the support of their employer. The project is very stable. There are no new features in sight and very few bug reports. Maintenance would consist in roughly one day a month, generally spent answering incoming questions and working with users to solve their problems or review patches.
</p>

<p>
Let us know if you're interested!
</p>
</div>
</div>
</div>




<div id="outline-container-orgdc3b296" class="outline-2">
<h2 id="9"><a id="orgdc3b296"></a>Build-/Installation-Tools - not enogh of them?</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00059.html">https://sympa.inria.fr/sympa/arc/caml-list/2018-11/msg00059.html</a>
</p>
</div>
