2018.11.27.org
** From the ocamlcore planet blog


Here are links from many OCaml blogs aggregated at [[http://ocaml.org/community/planet/][OCaml Planet]].

- [[https://functionaljobs.com/jobs/9117-senior-haskell-full-stack-developer-at-proda-ltd][Senior Haskell / Full Stack Developer at PRODA Ltd (Full-time)]]
- [[http://gallium.inria.fr/blog/safely-typing-algebraic-effects][Safely typing algebraic effects]]
- [[https://jobs.github.com/positions/fbceb632-fbda-430e-b537-733ef5a8b298][Front End Developer (ReactJS & Purescript)]]
- [[http://www.ocamlpro.com/2018/11/21/an-introduction-to-tezos-rpcs-signing-operations/][An Introduction to Tezos RPCs: Signing Operations]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[http://alan.petitepomme.net/cwn/][the archive]] or the [[http://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[http://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
