2018.11.27.html
<div id="outline-container-orgf380190" class="outline-3">
<h3 id="orgf380190">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgf380190">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://functionaljobs.com/jobs/9117-senior-haskell-full-stack-developer-at-proda-ltd">Senior Haskell / Full Stack Developer at PRODA Ltd (Full-time)</a></li>
<li><a href="http://gallium.inria.fr/blog/safely-typing-algebraic-effects">Safely typing algebraic effects</a></li>
<li><a href="https://jobs.github.com/positions/fbceb632-fbda-430e-b537-733ef5a8b298">Front End Developer (ReactJS &amp; Purescript)</a></li>
<li><a href="http://www.ocamlpro.com/2018/11/21/an-introduction-to-tezos-rpcs-signing-operations/">An Introduction to Tezos RPCs: Signing Operations</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org90cb535" class="outline-2">
<h2 id="org90cb535">Old CWN</h2>
<div class="outline-text-2" id="text-org90cb535">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
